---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Room.UnboundedHeight
zh: 房间
source: html/90d5ad07-8b4f-87fd-7ba1-4942496df7d5.htm
---
# Autodesk.Revit.DB.Architecture.Room.UnboundedHeight Property

**中文**: 房间

Get the Unbounded Height of the Room.

## Syntax (C#)
```csharp
public double UnboundedHeight { get; }
```

## Remarks
This property is used to get the Unbounded Height of the Room.